clc, clear
r = [1.000, 0.577, 0.509, 0.387, 0.462; ...
    0.577, 1.000, 0.599, 0.389, 0.322; ...
    0.509, 0.599, 1.000, 0.436, 0.426; ...
    0.387, 0.389, 0.436, 1.000, 0.523; ...
    0.462, 0.322, 0.426, 0.523, 1.000];
% 下面利用相关系数阵求主成分解，vec 的列为 r 的特征向量，即主成分系数
[vec, val, rate] = pcacov(r); % val 为 r 的特征值，rate 为各个主成分的贡献率
a = vec .* sqrt(val') % 构造全部因子的载荷矩阵，见（10.27）式
a1 = a(:, 1) % 提出一个因子的载荷矩阵
tcha1 = diag(r-a1*a1') % 计算一个因子的特殊方差
a2 = a(:, [1, 2]) % 提出两个因子的载荷矩阵
tcha2 = diag(r-a2*a2') % 计算两个因子的特殊方差
ccha2 = r - a2 * a2' - diag(tcha2) % 求两个因子时的残差矩阵
con = cumsum(rate) % 求累积贡献率